In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
dframe1 = DataFrame(np.arange(8).reshape((2, 4)),
                 index=pd.Index(['LA', 'SF'], name='city'),
                 columns=pd.Index(['A', 'B', 'C','D'], name='letter'))

In [5]:
dframe1

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [6]:
dframe_st = dframe1.stack()

In [7]:
dframe_st

city  letter
LA    A         0
      B         1
      C         2
      D         3
SF    A         4
      B         5
      C         6
      D         7
dtype: int64

In [8]:
dframe_st.unstack()

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [9]:
dframe_st.unstack('letter')

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [10]:
dframe_st.unstack('city')

city    LA  SF
letter
A        0   4
B        1   5
C        2   6
D        3   7

In [11]:
ser1 = Series([0,1,2],index = ['Q','X','Y'])

In [12]:
ser2 = Series([4,5,6],index = ['X','Y','Z'])

In [13]:
ser1

Q    0
X    1
Y    2
dtype: int64

In [14]:
ser2

X    4
Y    5
Z    6
dtype: int64

In [15]:
dframe = pd.concat([ser1, ser2], keys = ['A','B'] )

In [16]:
dframe

A  Q    0
   X    1
   Y    2
B  X    4
   Y    5
   Z    6
dtype: int64

In [17]:
dframe.unstack()

    Q  X  Y   Z
A   0  1  2 NaN
B NaN  4  5   6

In [18]:
dframe.unstack().stack()

A  Q    0
   X    1
   Y    2
B  X    4
   Y    5
   Z    6
dtype: float64

In [19]:
dframe = dframe.unstack()

In [20]:
dframe

    Q  X  Y   Z
A   0  1  2 NaN
B NaN  4  5   6

In [21]:
dframe.stack(dropna = False)

A  Q     0
   X     1
   Y     2
   Z   NaN
B  Q   NaN
   X     4
   Y     5
   Z     6
dtype: float64

In [22]:
import pandas.util.testing as tm; tm.N = 3

#Create a unpivoted function
def unpivot(frame):
    N, K = frame.shape
    
    data = {'value' : frame.values.ravel('F'),
            'variable' : np.asarray(frame.columns).repeat(N),
            'date' : np.tile(np.asarray(frame.index), K)}
    
    # Return the DataFrame
    return DataFrame(data, columns=['date', 'variable', 'value'])

#Set the DataFrame we'll be using
dframe = unpivot(tm.makeTimeDataFrame())

In [23]:
dframe

         date variable     value
0  2000-01-03        A  1.310093
1  2000-01-04        A  0.256746
2  2000-01-05        A -2.634345
3  2000-01-03        B  0.511688
4  2000-01-04        B -0.254823
5  2000-01-05        B -0.950046
6  2000-01-03        C -0.259258
7  2000-01-04        C  1.202819
8  2000-01-05        C  0.113535
9  2000-01-03        D -0.586570
10 2000-01-04        D -1.308442
11 2000-01-05        D  0.607275

In [24]:
dframe_piv = dframe.pivot('date','variable','value')

In [25]:
dframe_piv

variable           A         B         C         D
date
2000-01-03  1.310093  0.511688 -0.259258 -0.586570
2000-01-04  0.256746 -0.254823  1.202819 -1.308442
2000-01-05 -2.634345 -0.950046  0.113535  0.607275